load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 500
  defaults:
    headers:
      Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJiYWNrZW5kLXVzZXIiLCJ1c2VybmFtZSI6ImFkbWluQGdtYWlsLmNvbSIsImlhdCI6MTc3ODU3NTY2NSwiZXhwIjoxNzc4NTc5MjY1fQ.L_-0pzegHAaVAaA3tTdXElPqbAgqAmsajfMco8T9nlw"
      Content-Type: "application/json"

scenarios:
  - name: "create-candidate"
    flow:
      - post:
          url: "/api/candidates"
          multipart:
            - name: "nom"
              value: "Rakoto"
            - name: "prenom"
              value: "Aina"
            - name: "email"
              value: "candidate-{{ $randomString() }}@example.com"
            - name: "telephone"
              value: "+261 34 12 345 67"
            - name: "poste"
              value: "Backend Developer"
            - name: "annee_experience"
              value: "4"
            - name: "competence"
              value: "Node.js,TypeScript"